<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"8ad63ef8144a9a418672e8d068f7aeb3c19f217b06dd794abf28e6bd11e746d7","plan_job_ref":"Job Test matrix config workflow #9 at https://github.com/tx-pts-dai/github-workflows/actions/runs/7277506242","plan_hash":"a1aec0c9401fefc5331dbf3c82d7d597240d4e67edd62c480405399ade88e773","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __tests/terraform__
With backend config: `backend=s3
bucket=tf-state-911453050078
key=tests/prod.tfstate
`
With var files: `tests/terraform/environment/prod.tfvars

`<details open><summary>With variables</summary>

```hcl
environment = "prod"
github_repo = "github-workflows"
region      = "us-east-1"
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_pet.this will be created
  + resource "random_pet" "this" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "prod-us-east-1-github-workflows-"
      + separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_id  = (known after apply)
  + random_pet = (known after apply)
```
</details>

:memo: Plan generated in [Test matrix config workflow #9](https://github.com/tx-pts-dai/github-workflows/actions/runs/7277506242)